In [1]:
!pip install pandas

Requirement already satisfied: pandas in /opt/anaconda3/lib/python3.11/site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /opt/anaconda3/lib/python3.11/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [5]:
# pandas
# 1) Data Analysys
# 2) Data Exploring
# 3) Data Cleaning
# 4) Data Manipulation

# pandas---> Excel, CSV (Comma Separated Values), json

In [7]:
# Data structures in pandas

# 1) Series
# 2) DataFrame

In [9]:
# Series: a single column in a table

# Dataframe: collection of series

In [11]:
usernames=["krlss","moris","hey","ok","ayush","hello world"]

In [15]:
type(usernames)

list

In [17]:
data=pd.Series(usernames)

In [19]:
data

0          krlss
1          moris
2            hey
3             ok
4          ayush
5    hello world
dtype: object

In [21]:
data[4]

'ayush'

In [25]:
# change indexing

In [29]:
data=pd.Series(
    ["krlss","moris","hey","ok","ayush","hello world"],
    index=['a','b','z','c','d','e']
)

In [31]:
data

a          krlss
b          moris
z            hey
c             ok
d          ayush
e    hello world
dtype: object

In [33]:
data['z']

'hey'

In [35]:
# creating dataframes

In [37]:
df=pd.DataFrame({
'username':["krlss","moris","hey","ok","ayush","hello world"],
    'age':[20,23,24,23,34,56],
    'phone number':[9327493845,32854737,3693242,349873,346832,38746334],
})

In [41]:
df

      username  age  phone number
0        krlss   20    9327493845
1        moris   23      32854737
2          hey   24       3693242
3           ok   23        349873
4        ayush   34        346832
5  hello world   56      38746334

In [45]:
# df[4]

In [79]:
data=pd.DataFrame({
    'student name':["aman","gagan","arman","jot"],
    'roll no':[23,34,56,67],
    'class':[3,2,3,4],
},
                 index=[1,2,3,4])
data

  student name  roll no  class
1         aman       23      3
2        gagan       34      2
3        arman       56      3
4          jot       67      4

In [63]:
type(df)

pandas.core.frame.DataFrame

In [71]:
x=df['age']

In [73]:
x

0    20
1    23
2    24
3    23
4    34
5    56
Name: age, dtype: int64

In [75]:
type(x)

pandas.core.series.Series

In [83]:
# tables=pd.DataFrame({
#     '2':[for i in range(1,11):
#                 print(f"2 X {i} = 2*i")],
#     '4':[for i in range(1,11):
#                 print(f"4 X {i} = 4*i")],
#     '6':[for i in range(1,11):
#                  print(f"6 X {i} = 6*i")],
#     '8':[for i in range(1,11):
#                  print(f"8 X {i} = 8*i")],
#     '10':[for i in range(1,11):
#                  print(f"10 X {i} = 10*i")],
# })

In [85]:
import numpy as np

In [2]:
# for i in range(1,11):
#     print(f"{x} X {i} = {x*i}")

In [91]:
def createtable(x):
    lst=[]
    for i in range(1,11):
        lst.append(f"{x} X {i} = {x*i}")
    return lst

In [93]:
createtable(4)

['4 X 1 = 4',
 '4 X 2 = 8',
 '4 X 3 = 12',
 '4 X 4 = 16',
 '4 X 5 = 20',
 '4 X 6 = 24',
 '4 X 7 = 28',
 '4 X 8 = 32',
 '4 X 9 = 36',
 '4 X 10 = 40']

In [95]:
tables=pd.DataFrame({
    '2': createtable(2),
    '4': createtable(4),
    '6': createtable(6),
    '8': createtable(8),
    '10': createtable(10)
})

In [97]:
tables

             2            4            6            8             10
0    2 X 1 = 2    4 X 1 = 4    6 X 1 = 6    8 X 1 = 8    10 X 1 = 10
1    2 X 2 = 4    4 X 2 = 8   6 X 2 = 12   8 X 2 = 16    10 X 2 = 20
2    2 X 3 = 6   4 X 3 = 12   6 X 3 = 18   8 X 3 = 24    10 X 3 = 30
3    2 X 4 = 8   4 X 4 = 16   6 X 4 = 24   8 X 4 = 32    10 X 4 = 40
4   2 X 5 = 10   4 X 5 = 20   6 X 5 = 30   8 X 5 = 40    10 X 5 = 50
5   2 X 6 = 12   4 X 6 = 24   6 X 6 = 36   8 X 6 = 48    10 X 6 = 60
6   2 X 7 = 14   4 X 7 = 28   6 X 7 = 42   8 X 7 = 56    10 X 7 = 70
7   2 X 8 = 16   4 X 8 = 32   6 X 8 = 48   8 X 8 = 64    10 X 8 = 80
8   2 X 9 = 18   4 X 9 = 36   6 X 9 = 54   8 X 9 = 72    10 X 9 = 90
9  2 X 10 = 20  4 X 10 = 40  6 X 10 = 60  8 X 10 = 80  10 X 10 = 100

In [103]:
# question

In [105]:
zx=["thiscarrr","thisbusss","thisbikee","thistrain"]

In [126]:
def func(v):
    lst=[]
    for i in v:
        v
        lst.append(i)
    return lst
func("this")

['t', 'h', 'i', 's']

In [128]:
# v="train"
# for i in zx:
#     print(i)

In [130]:
variable=pd.DataFrame({
    "thiscarrr":func("thiscarrr"),
    "thisbusss":func("thisbusss"),
    "thisbikee":func("thisbikee"),
    "thistrain":func("thistrain")
})
variable

  thiscarrr thisbusss thisbikee thistrain
0         t         t         t         t
1         h         h         h         h
2         i         i         i         i
3         s         s         s         s
4         c         b         b         t
5         a         u         i         r
6         r         s         k         a
7         r         s         e         i
8         r         s         e         n